################ シンドローム ################
use strict;
use utf8;

package data;

## シンドロームリスト
our @syndromes = (
  '天使光環',
  '重力魔眼',
  '雷擊黑犬',
  '鮮血真祖',
  '變異魔獸',
  '流亡畸體',
  '疾速靈猿',
  '煉金化形',
  '神腦演算',
  '冥府領域',
  '冰炎奇蜥',
  '幻象投影',
  '噬身影蛇',
  '弒神魂劍',
  '縛狼魔鎖',
  '阿撒托斯',
);

## 能力値補正
our %syndrome_status = (
  '天使光環' => [0,3,1,0],
  '重力魔眼'           => [0,1,2,1],
  '雷擊黑犬'     => [2,1,1,0],
  '鮮血真祖' => [1,2,1,0],
  '變異魔獸'         => [3,0,0,1],
  '流亡畸體'         => [2,1,0,1],
  '疾速靈猿'         => [1,1,1,1],
  '煉金化形'       => [1,2,0,1],
  '神腦演算'           => [0,0,3,1],
  '冥府領域'           => [0,1,1,2],
  '冰炎奇蜥'       => [2,0,1,1],
  '幻象投影'           => [0,0,1,3],
  '噬身影蛇'         => [1,1,2,0],
  '弒神魂劍'     => [2,2,0,0],
  '縛狼魔鎖'       => [1,0,2,1],
  '阿撒托斯'         => [1,0,3,0],
);

## 覚醒・衝動リスト
our @awakens = (
  ['死'  ,18],
  ['憤怒',17],
  ['素体',16],
  ['感染',14],
  ['渇望',17],
  ['無知',15],
  ['犠牲',16],
  ['命令',15],
  ['忘却',17],
  ['探求',14],
  ['償い',18],
  ['生誕',17],
  ['LABEL=CRC用'],
  ['恐怖',17],
  ['救済',16],
  ['狂気',15],
  ['神命',15],
  ['実験',18],
);
our @impulses = (
  ['解放',18],
  ['吸血',17],
  ['飢餓',14],
  ['殺戮',18],
  ['破壊',16],
  ['加虐',15],
  ['嫌悪',15],
  ['闘争',16],
  ['妄想',14],
  ['自傷',16],
  ['恐怖',17],
  ['憎悪',18],
  ['改変',30],
);

1;